# GetConditionDescription Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..GetConditionDescription Method
FabricationServiceButton Class See Also
---
Gets the description for the condition size range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string GetConditionDescription(
	int condition
)
```

Visual Basic
---
```text
Public Function GetConditionDescription ( _
	condition As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetConditionDescription(
	int condition
)
```

# ### Parameters
condition
    Type: System..::..Int32 The index of the condition in the service button.
# ### Return Value
A user-defined string that describes the condition range, as defined in the fabrication configuration. For example, this may describe the size of the range or describe the type of fitting.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index condition is not larger or equal to 0 and less than ConditionCount. |

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace